import React from 'react';
import { FontAwesomeIcon } from '@fortawesome/react-fontawesome';
import { faStaffSnake } from '@fortawesome/free-solid-svg-icons';
import { Link } from 'react-router-dom'

export default function Detail() {
  return (
         
         <div className=' p-6 py-10 max-w-6xl mx-auto font-ubuntu'>

              <div className= " relative bg-bg p-8 pb-12 rounded-md opacity-85 space-y-6">

                  <div className=" flex justify-between">

                      <FontAwesomeIcon icon={ faStaffSnake } />
                      <FontAwesomeIcon icon={ faStaffSnake } />

                  </div>

                  <p className=" text-black leading-8 font-semibold opacity-100">မြွေသည် ရက်ပတီလီယာ မျိုးပေါင်းတွင် စကွာမေတာမျိုးစဉ် ဆာပင်တီး မျိုးစဉ်ခွဲ၌ ပါဝင်၏။ မြွေကို ကိုင်ကြည့်လျှင် အေးခြင်းမှာ ယင်းသည် သွေးအေး သတ္တဝါဖြစ်ခြင်းကြောင့် ဖြစ်သည်။ လူတို့သည် မြွေကို များသောအားဖြင့် ကြောက်၏။ ထိုအချက်ကြောင့်ပင် မြွေကို ကြောက်စိတ်မရှိသူများအဖို့နှင့် ကြောက်စိတ်ကို ကျော်လွန်နိုင်သူများအဖို့ မြွေသည် ပို၍ စိတ်ဝင်စားဖွယ် ကောင်းလာလေသည်။ မြွေကို လူသည် မွေးကတည်းက ကြောက်မလာချေ။ ကလေးသည် မြွေကို ကြောက်စိတ်နှင့် ကြည့်သည့်ထက် စိတ်ဝင်စားစွာ ကြည့်သည်က များသည်။</p>

                  <p className=' text-black leading-8 font-semibold opacity-100 '>ခြေထောက် မရှိသော တွားသွားသတ္တဝါများတွင် မြွေကို လူသိအများဆုံးဖြစ်သည်။ မြွေကို အခြားဒေသများတွင် တွေ့ရသည်ထက် မြန်မာနိုင်ငံကဲ့သို့သော အပူပိုင်းဒေသများတွင် ပို၍ တွေ့ရသည်။ အကြီးဆုံး မြွေများကိုလည်း အပူပိုင်း ဒေသများတွင်သာ ပို၍ တွေ့ရသည်။ အချို့မြွေများသည် ပေ ၃ဝ အထိ ရှည်တတ်ကြသကဲ့သို့ ငါးလက်မထက်ပို၍ မရှည်သော မြွေကလေးများကိုလည်း တွေ့ရသည်။ နယူးဇီယန်၊ အိုင်ယာလန် နှင့် ဟာဝိုင်းယန်းကျွန်းများတွင် မြွေကို မတွေ့ရချေ။ ဟာဝိုင်းယန်းကျွန်းတွင်မူ နောင်အခါ၌ ဘေးမပြုသော မြွေများကို ယူဆောင်သွားကြသဖြင့် တွေ့ရလေသည်။</p>

                  <p className=' text-black leading-8 font-semibold opacity-100'>မျိုးစိတ်ပေါင်း ၂၃ဝဝ ခန့်ရှိသော မြွေများကို အနည်းငယ်မျှသော ကျွန်းများနှင့် အလွန်အေးသည့် ဒေသများမှအပ ကျန်ဒေသများတွင် တွေ့နိုင်သည်။ အပူပိုင်းဒေသရှိ အလွန်ထူထပ်သော တောများမှအစ၊ သဲကန္တာရများ၊ တောင်ထိပ်များနှင့် မြေကြီးအောက်ရှိ တွင်းများအဆုံးထိ တွေ့နိုင်၏။ အချို့သော မြွေများကို သစ်ပင်များပေါ်တွင် အနေများသည်။ အချို့ကို စိမ့်များ၊ ရေချိုအိုင်များနှင့် မြစ်များတွင် တွေ့ရသည်။</p>

                  <p className=' text-black leading-8 font-semibold opacity-100 ' >အချို့ကိုမူ ပင်လယ်များအတွင်း၌ တွေ့ရလေသည်။ ထိုပင်လယ်မြွေများကို အာရှတိုက်၊ အာဖရိကတိုက်နှင့် ထိစပ်လျက်ရှိသော အပူပိုင်းဒေသ ပင်လယ်များတွင် အတွေ့ရများသည်။ ပင်လယ်မြွေများ၏ နံဘေးသည် ပြားနေကြသဖြင့် ရေကူးရာ၌ လွန်စွာ သန်ကြသော်လည်း ကုန်းပေါ်တွင်မူ ကောင်းစွာ မသွားနိုင်ကြချေ။ ပင်လယ်မြွေများသည် မျိုးစိတ်အားဖြင့် ၅ဝ ခန့် ရှိ၍ အားလုံးသည် လွန်စွာ အဆိပ်ပြင်းကြလေသည်။ ယင်းတို့၌ အဆုတ်ကြီးများရှိသဖြင့် ရေနက်များတွင် နေနိုင်ကြ၍ စားရန် ငါးများကို လိုက်ဖမ်းကြလေသည်။ </p>

                  <Link to='/' className=" absolute right-6 bottom-6 "> 
                      
                       <button className=" block p-1 px-3 text-base font-normal bg-sec rounded mt-4 hover:tracking-widest opacity-100"> Back </button>
                       
                  </Link>

              </div>

         </div>
  )
}
